---
kind: method
id: M:Autodesk.Revit.DB.ParameterFilterUtilities.GetAllFilterableCategories
source: html/5dc40235-09fe-d2e4-5ca3-399519fe0255.htm
---
# Autodesk.Revit.DB.ParameterFilterUtilities.GetAllFilterableCategories Method

Returns the set of categories that may be used in a ParameterFilterElement.

## Syntax (C#)
```csharp
public static ICollection<ElementId> GetAllFilterableCategories()
```

## Returns
The set of all filterable categories.